#include "s21_string.h"

#include <stdlib.h>

// ------------------------------s21_memchr----------------------------------------------
// Выполняет поиск первого вхождения символа c в первых n байтах строки, на
// которую указывает аргумент str
void *s21_memchr(const void *str, int c, s21_size_t n) {
  unsigned char *s = (unsigned char *)str;  //указатель на первый символ строки
  void *out = S21_NULL;  // совпадение не найдено
  for (s21_size_t i = 0; i < n; i++) {  //проходим указанное кол-во символов
    if (*s == (unsigned char)c) {
      out = s;  // указатель на найденный байт
      break;
    }
    s++;  //следующий символ
  }
  return out;
}
// --------------------------------------------------------------------------------------

// ------------------------------s21_memcmp----------------------------------------------
//Сравнивает первые n байтов str1 и str2
//очень похоже на strncmp, но тут abc\o\o и abc\0d - не равны, а там равны, тк
//конец строки игнорируется пока не дойдет до n
int s21_memcmp(const void *str1, const void *str2, s21_size_t n) {
  char *s1 = (char *)str1;  //указатель на первый символ 1й строки
  char *s2 = (char *)str2;  //указатель на первый символ 2й строки
  int res = 0;  //результат сравнения, к примеру (str1)a и (str2)b  = -1;
                //(str1)c и (str2)a = 2
  for (s21_size_t i = 0; i < n; i++) {
    res = *s1 - *s2;
    if (*s1 != *s2) break;  //до первого различия
    s1++;
    s2++;
  }
  return res;
}
// --------------------------------------------------------------------------------------

// ------------------------------s21_memcpy----------------------------------------------
//Копирует n символов из src в dest = заполняет
void *s21_memcpy(void *dest, const void *src, s21_size_t n) {
  char *d = (char *)dest;  //указатель на первый символ редактируемой строки
  char *s = (char *)src;  //указатель на первый символ строки
  for (s21_size_t i = 0; i < n; i++) {
    d[i] = s[i];
  }
  return dest;
}
//Если длина строки src < n или длина строки dest <= n, то поведение будет
//неопределенным
// --------------------------------------------------------------------------------------

// ------------------------------s21_memset----------------------------------------------
//Копирует символ c в первые n символов строки, на которую указывает аргумент
// str как memcpy только все n байт меняет на 1 символ   abs (c = x, n = 3) ->
// xxx
void *s21_memset(void *str, int c, s21_size_t n) {
  char *s = (char *)str;  //указатель на первый символ строки
  for (s21_size_t i = 0; i < n; i++) {
    s[i] = c;
  }
  return str;
}
// -------------------------------------------------------------------------------------

// ------------------------------s21_strncat--------------------------------------------
//Добавляет строку, на которую указывает src, в конец строки, на которую
//указывает dest, длиной до n символов
char *s21_strncat(char *dest, const char *src, s21_size_t n) {
  s21_size_t lenght = s21_strlen(dest);  //длина новой строки
  for (s21_size_t i = 0; i < n; i++) {
    dest[lenght + i] = src[i];
  }
  return dest;
}
// если не хватает длины буфера - то неопределенное поведение
// -------------------------------------------------------------------------------------

// ------------------------------s21_strchr--------------------------------------------
//Выполняет поиск первого вхождения символа c в строке, на которую указывает
//аргумент str
// как memchr но не ограничивается байтами
char *s21_strchr(const char *str,
                 int c) {  //Выполняет поиск первого вхождения символа c в
                           //строке, на которую указывает аргумент str
  char *out = S21_NULL;  //порядковый номер

  for (s21_size_t i = 0; i <= s21_strlen(str); i++) {  // проходим всю строку
    if (str[i] == c) {
      out = ((char *)str) + i;
      break;
    }
  }

  return out;
}
// -------------------------------------------------------------------------------------

// ------------------------------s21_strncmp--------------------------------------------
//Сравнивает не более первых n байтов str1 и str2
//очень похоже на memcmp, но тут abc\o\o и abc\0d - равны, а там нет, тк счет
//идет пока одна из строк не закончится или n
int s21_strncmp(const char *str1, const char *str2, s21_size_t n) {
  char *s1 = (char *)str1;  //указатель на первый символ 1й строки
  char *s2 = (char *)str2;  //указатель на первый символ 2й строки
  int res = 0;  //результат сравнения, к примеру (str1)a и (str2)b  = -1;
                //(str1)c и (str2)a = 2
  for (s21_size_t i = 0; i < n; i++) {
    res = *s1 - *s2;
    if (*s1 != *s2 || *s1 == '\0' || *s2 == '\0')
      break;  //до первого различия, учитывая сивол конца строки
    s1++;
    s2++;
  }
  return res;
}
// --------------------------------------------------------------------------------------

// ------------------------------s21_strncpy----------------------------------------------
//Копирует до n символов из строки, на которую указывает src, в dest
char *s21_strncpy(char *dest, const char *src, s21_size_t n) {
  char *d = (char *)dest;  //указатель на первый символ редактируемой строки
  char *s = (char *)src;  //указатель на первый символ строки
  for (s21_size_t i = 0; i < n; i++) {
    if (s21_strlen(src) <= i)
      d[i] = '\0';
    else
      d[i] = s[i];
  }

  return dest;
}
//Если длина строки src < n, то в конец строки dest добавляются недостающие
//нулевые символы. Если же длина строки src > n, то строка dest, не будет
//заканчиваться символом конца строки.
// --------------------------------------------------------------------------------------

// ------------------------------s21_strcspn---------------------------------------------
size_t s21_strcspn(const char *str1, const char *str2) {
  int len1 = s21_strlen(str1);
  int len2 = s21_strlen(str2);
  int i;
  for (i = 0; i < len1; i++)
    for (int j = 0; j < len2; j++)
      if (str1[i] == str2[j]) return i;
  return i;
}
// --------------------------------------------------------------------------------------

static char buffer[1024];

// ------------------------------s21_strerror--------------------------------------------
char *s21_strerror(int errnum) {
  if (errnum < NUMBER_OF_ERRORS && errnum >= 0) {
    s21_strncpy(buffer, s21_error_array[errnum], 1024);
  } else {
    s21_sprintf(buffer, "%s %d", UNKNOWN, errnum);
  }
  return buffer;
}
// --------------------------------------------------------------------------------------

// ------------------------------s21_strlen----------------------------------------------
//Вычисляет длину строки str, не включая \0
s21_size_t s21_strlen(const char *str) {
  const char *current_c;  //указатель на текущий символ
  size_t lenght = 0;      // размер строки
  for (current_c = str; *current_c != '\0'; ++current_c) {
    lenght++;
  }
  return lenght;
}
// -------------------------------------------------------------------------------------

// ------------------------------s21_strpbrk--------------------------------------------
//Находит первый символ в строке str1, который соответствует любому символу,
//указанному в str2
char *s21_strpbrk(const char *str1, const char *str2) {
  char *out = S21_NULL;  //порядковый номер
  s21_size_t lenStr1 = s21_strlen(str1);
  s21_size_t lenStr2 = s21_strlen(str2);
  int flag = 0;
  for (s21_size_t i = 0; i < lenStr1; i++) {  // проходим всю 1ю строку
    for (s21_size_t j = 0; j < lenStr2; j++) {  // проходим всю 2ю строку
      if (str1[i] == str2[j] && flag == 0) {
        out = ((char *)str1) + i;
        flag = 1;
      }
    }
    if (flag == 1)
      break;  //в целом можно убрать, цикл пройдет до конца и покажет первое
              //совпадение
  }
  return out;
}
//Поиск не учитывает завершающий нуль-символ
// -------------------------------------------------------------------------------------

// ------------------------------s21_strrchr--------------------------------------------
//Выполняет поиск последнего вхождения символа c (беззнаковый тип) в строке, на
//которую указывает аргумент str.
char *s21_strrchr(const char *str, int c) {
  char *out = S21_NULL;  //порядковый номер
  for (s21_size_t i = 0; i <= s21_strlen(str); i++) {  //обработка 123\0asd\0
    if (str[i] == c)
      out = ((char *)str) + i;  // отличие от strchr - не выходим сразу, когда
                                // найдено совпадение, а ищем до конца
  }
  return out;
}
// -------------------------------------------------------------------------------------

// ------------------------------s21_strstr---------------------------------------------
char *s21_strstr(const char *haystack, const char *needle) {
  char *pointer = S21_NULL;
  int needleLen;
  char *hayStack = (char *)haystack;
  needleLen = s21_strlen(needle) - 1;
  for (int i = 0; hayStack[i] != '\0' && pointer == S21_NULL; i++) {
    int flag, j;
    j = 0;
    flag = 1;
    while ((j <= needleLen) && flag) {
      flag = hayStack[i + j] == needle[j];
      j++;
    }
    if (flag && (j > needleLen)) {
      pointer = &(hayStack[i]);
    }
  }
  return pointer;
}
// -------------------------------------------------------------------------------------

// ------------------------------s21_strtok---------------------------------------------
char *s21_strtok(char *str, const char *delim) {
  static char *last = S21_NULL;
  char *st = S21_NULL;
  if (str) {
    last = str;
  }
  if (last != 0 && *last != 0) {
    char *c = last;
    while (s21_strchr(delim, *c)) {
      ++c;
    }
    if (*c != 0) {
      st = c;
      while (*c && (s21_strchr(delim, *c) == 0)) {
        ++c;
      }
      if (*c == 0) {
        last = c;
      } else {
        *c = 0;
        last = c + 1;
      }
    }
  }
  return st;
}
// -------------------------------------------------------------------------------------